Ran Plan for project: `terraform-erick` dir: `infra/terraform-erick` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.ecs_frontend.data.aws_iam_policy_document.ecs_assume_role_policy: Reading...
module.ecs_frontend.data.aws_iam_policy_document.ecs_assume_role_policy: Read complete after 0s [id=1077804475]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "app-evaluacion-cluster"
      + region   = "us-east-2"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ecr.aws_ecr_repository.frontend_repo will be created
+ resource "aws_ecr_repository" "frontend_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "app-frontend"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ecs_frontend.aws_cloudwatch_log_group.frontend_logs will be created
+ resource "aws_cloudwatch_log_group" "frontend_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/app-frontend"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs_frontend.aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "app-cluster"
      + region   = "us-east-2"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ecs_frontend.aws_ecs_service.frontend will be created
+ resource "aws_ecs_service" "frontend" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "app-frontend"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_frontend.aws_ecs_task_definition.frontend will be created
+ resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "250"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "app-frontend"
      + id                       = (known after apply)
      + memory                   = "548"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs_frontend.aws_iam_policy.ecs_exec_command_policy will be created
+ resource "aws_iam_policy" "ecs_exec_command_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ecs-exec-command-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:*",
                          + "ssm:StartSession",
                          + "ecs:ExecuteCommand",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_frontend.aws_iam_role.ecs_task_execution_role will be created
+ resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_frontend.aws_iam_role.ecs_task_role will be created
+ resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_frontend.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "app-ecs-task-execution-role"
    }

  # module.ecs_frontend.aws_iam_role_policy_attachment.ecs_task_role_policy will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "app-ecs-task-role"
    }

  # module.ecs_frontend.aws_iam_role_policy_attachment.exec_command_attach will be created
+ resource "aws_iam_role_policy_attachment" "exec_command_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-ecs-task-execution-role"
    }

  # module.monitoring.aws_cloudwatch_log_group.monitoring_log_group will be created
+ resource "aws_cloudwatch_log_group" "monitoring_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/app/monitoring"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.high_cpu_usage will be created
+ resource "aws_cloudwatch_metric_alarm" "high_cpu_usage" {
      + actions_enabled                       = true
      + alarm_description                     = "Alarm when CPU usage exceeds 80%"
      + alarm_name                            = "app-high-cpu-usage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "eduia-cluster"
          + "ServiceName" = "eduia-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + region                                = "us-east-2"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.network.aws_internet_gateway.igw will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-2"
      + tags     = {
          + "Name" = "app-igw"
        }
      + tags_all = {
          + "Name" = "app-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "app-public-rt"
        }
      + tags_all         = {
          + "Name" = "app-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.public_subnet_association[0] will be created
+ resource "aws_route_table_association" "public_subnet_association" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_subnet_association[1] will be created
+ resource "aws_route_table_association" "public_subnet_association" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.ecs_sg_frontend will be created
+ resource "aws_security_group" "ecs_sg_frontend" {
      + arn                    = (known after apply)
      + description            = "ECS security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "app-ecs-sg-frontend"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-ecs-sg-frontend"
        }
      + tags_all               = {
          + "Name" = "app-ecs-sg-frontend"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[0] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "app-public-subnet-0"
        }
      + tags_all                                       = {
          + "Name" = "app-public-subnet-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[1] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "app-public-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "app-public-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-2"
      + tags                                 = {
          + "Name" = "app-vpc"
        }
      + tags_all                             = {
          + "Name" = "app-vpc"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ monitoring_high_cpu_alarm_arn = (known after apply)
+ monitoring_log_group_name     = "/ecs/app/monitoring"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-erick`
* :put_litter_in_its_place: To **delete** this plan click [here](http://6de8446eaf05:4141/lock?id=ErickRdzRm7%252Fevaluacion%252Finfra%252Fterraform-erick%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-erick`
</details>
Plan: 22 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
